[{"doctorId":null,"name":"Dr. Juan Lopez Corvala","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Lopez Corvala is considered among the top ten weight-loss surgeons in the world and the standard for excellence in bariatric weight-loss surgery thanks to his extensive practicing and academic history. He has performed more than 10,000 laparoscopic surgeries with more than half being bariatric weight-loss surgeries, is a regular speaker at the industry’s top events around the world, has held many academic positions including professor of weight-loss specialty courses at Yale University in Connecticut United States, has published multiple books around many related techniques and is board member at the most recognized medical associations around the world.|Dr. Lopez Corvala obtained his medical education with a specialty in general surgery from the LaSalle University in Mexico City which is one of the most recognized universities for surgeons in Mexico and now with over 30 years of practicing experience continues performing all of his own surgeries himself and continues to mentor many veteran surgeons including serving as Proctor for INAMED worldwide where he teaches many U.S. surgeons who are training bariatric surgery","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-juan-lopez-corvala\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Honorary Member of the Gastroenterology Association of Guanajuato.|Member of the Mexican Association of Endoscopic Surgery (AMCE).|Member of the Latin American Association of Endoscopic Surgery (ALACE).|Member of the International Federation of Obesity Surgery and Metabolic Disorders.|Member of the Council of Advanced Bariatrics (C.A.B.).|Member of the Mexican Association of Obesity Surgery.|Member of the Mexican Association of General Surgery (AMCG).|Member of the General Surgeons Association in Tijuana.|Member of The Mexican College for Obesity Surgery and Metabolic Diseases.|Certified General Surgeon by the Mexican Board of General Surgery (No. 2454).|Certified General Surgeon by the Mexican Council of General Surgery.|Certified Bariatric Surgeon by The Mexican College for Obesity Surgery and Metabolic diseases.|Certified Bariatric Surgeon Specialist by The Mexican Council of General Surgery A.C.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/02\/Dr_juan_lopez_corvala-1.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Darío Esau Garin Zertuche","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Garin is a top Orthopedic Surgeon trained at Universidad Autonoma de Baja California. In addition, he is a |. Currently he is the |, one of the best hospitals in Mexico.|Dr. Garrin is a |. He is a published author in different medical journals and it’s a member of recognized associations in the orthopedic industry.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-dario-esau-garin-zertuche\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"American Academy of Orthopedic Surgeons (AAOS).|Sociedad Mexicana de Ortopedia (SMO).|Federación Mexicana de Ortopedia y Traumatología (FEMECOT).|Arthroscopy Association of North America (AANA).|Asociación Mexicana de Artroscopia y Reconstrucción Articular (AMECRA).|Arthroscopy and Joint Surgery Fellowship – Centro Nacional de Rehabilitación-Instituto de Ortopedia, Universidad Nacional Autónoma de México.|Adult Joint Reconstruction Fellowship – Centro Nacional de Rehabilitación-Instituto de Ortopedia, Universidad Nacional Autónoma de México.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/07\/Orthopedic-Surgery-02.png","otherActivities":"Treatment or Thoracolumbar Burst Fractures by Vertebral Shortening |. 11, No. 1, 2002. Pags: 8-12.|Comparative Retrospective Analysis of Two Different Medullary Plugs for Modern Cementing Technique in Total Hip Replacement. Evaluation of Cement Mantle and Plug Migration. | Vol 28, No. 1, 2004. Pags: 11-5.|Tendons and Ligaments Substitutes. | Vol. 10, No. 4, 2014. Pags: 227-234|ACL Injury. Treatment options in the Athlete. |Vol 12, No. 2, 2016. Pags: 88-95","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Jorge Zavala Ruiz","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Zavala earned his medical degree from Universidad Autonoma de Baja California, Mexico. He completed residencies at Hospital Gabriel Mancera IMSS, Mexico and Hospital Centro Medico Nacional Siglo XXI, Mexico.|Additional education includes a Fellowship in Surgical Oncology at Hospital Oncologia Centro Medico Nacional, Mexico. Dr. Zavala’s primary specialties are General Surgery, Laparoscopic Surgery and Surgical Oncology. He has published numerous articles on these topics.|He is fluent in Spanish and English, and currently on staff at Hospital Angeles, Tijuana.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-jorge-zavala-ruiz\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/16-Jorge-Zavala-Ruiz.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Ariel Perez","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Perez is a functional\/integrative physician, specializing in the treatment of chronic illnesses. He graduated from Baja California’s State University U.B.C. as a General Practitioner. Additional training and certification followed at the Institute for Functional Medicine, where he finished at the top of his class. His studies also include orthomolecular medicine, Autologous Immune Therapy, hyperthermia, hyperbaric chamber, ozone treatment, bioenergetics, exercise, and applied kinesiology.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-ariel-perez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Graduate, Baja California State University, U.B.C.|Member, National Board of General Practitioners|Member, Tijuana association of GPs|Certified in Functional Medicine by the Institute for Functional Medicine ( ACCME®)|Certified in Bioenergetics by the Vega academy Germany|Certified in Hyperthermia by the Heckel Academy Germany|Certified in Medical Ozone Therapy by the Medical Society for Ozone|Certified on applied Kinesiology by the Universidad Autonoma de Guadalajara","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/Dr_-Ariel_Perez.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Fernando Izquierdo","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Izquierdo is a |. In addition, he did his residency specialty at Hospital Civil of Guadalajara, in Orthopedics and Traumatology. Currently he works at Hospital Angeles in Tijuana, one of the best hospitals in Mexico as an Orthopedic Surgeon with a specialty in Spinal Surgery. |He |. In addition, he is a | and has ","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-fernando-izquierdo\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"“Treatment of Degenerative Lumbar Disease using the extreme Lateral Approach” Protos training program NUVASIVE. San Diego, CA.|American Academy of Orthopedic Surgeons 2017 Annual Meeting, San Diego, CA.|Treating Degenerative Lumbar Disease and Advance XLIF Expanded Indications with Extreme Lateral Interbody Fusion (XLIF) San Diego, California.|Endoscopic Spine Surgery, hands-on cadaveric training; Medical Innovations Training Institute, Henderson, Nevada; USA.|AO International. Avances en Osteosíntesis. Tijuana, B.C.|Orthopedic Grand Rounds and Clinical Conference, University of California. San Diego. He has attended every year since.|62nd Annual American Academy of Orthopedic Surgeons Meeting. Orlando, Florida.|Texas Tech University Health Science Center. Orthopedic Course- El Paso, Texas.|XXVII Surgical Technique of the Wellex Inter Spacer. Universidad Latinoamericana Campus Cuernavaca, Morelos.|V International Course of Minimally Invasive Surgery of the Lumbar Spine. University of Guadalajara; Guadalajara Jalisco.","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/06\/Spine-Surgery.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Alejandro Martinez Rueda","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"","website":"https:\/\/www.angeleshealth.com\/dr-alejandro-martinez-rueda\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/11-Alejandro-Martinez-Rueda.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Salvador Medina Sánchez","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Cosmetic surgery at Angeles Hospital Tijuana is led by our plastic surgeon, Dr. Salvador Medina Sanchez. He got his Medicine degree at University La Salle and studied his specialty in Plastic, Aesthetic and Reconstructive Surgery at one of the most famous universities in Mexico, National Autonomous University in Mexico (UNAM).|With more than 20 years of experience in multiple specialties such as: massive weight-loss and body contouring surgery (liposuction), he is a board member at multiple medical associations and the former head of plastic and reconstructive surgery in the country’s top university hospital.","spokenLanguages":"Spanish, English","website":"https:\/\/www.angeleshealth.com\/dr-salvador-medina-sanchez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Member of the Mexican Association of Plastic, Aesthetic and Reconstructive Surgery.|Member of the Obesity and Metabolic Syndrome Institute.|Member of the Mexican Council of Plastic and Aesthetic Surgery.|Member of the Association of Ex Residents and Residents of Plastic and Reconstructive Surgery.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/06\/Plastic-Surgery_00000.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Julio Serecero","provider":"Ophthalmologist|Oncology","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Serecero is a certified Dental Surgeon. He earned his DDS degree from the University of Baja California’s Faculty of Dentistry.|Additional education includes training in Oral Implantology by the Mexican Association of Oral Implantology.|Dr. Serecero’s primary specialties are General Dentistry, Oral Rehabilitation, Cosmetic Dentistry and Dental Implant Rehabilitation.|He is on staff at Hospital Angeles Tijuana and is head of its internal dental clinic, Angeles Dental. He is fluent in English and Spanish.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-julio-serecero\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Graduate of the Universidad Autonoma de Baja California , Mexico.|Diploma in Oral Implantology by the Mexican Association of Oral Implantology.|Certified Dental Surgeon by the National Board of Dentistry.|Certified, International Event of Oral Implantology, Republica of Cuba, Ministry of Public Health, Provincial Department of Stomatology|Board Certified Dentist by the National Council of Restorative Dentistry.|Member of the Mexican Association of Oral Implantology.|Member of the State of Baja California Oral Implantology Association.|Member of the National Board of Dentistry.|License No. 3620615.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/15-Julio-Serecero-Aispuro.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Donato Pérez Garcia","provider":"Ophthalmologist|Oncology","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Donato Pérez García is an Insulin Potentiation Therapy (IPT) specialist, focusing on the treatment of chronic illnesses. He graduated from University Anáhuac, School of Medicine.|Dr. Donato Pérez García is the 3rd generation of IPT physicians; In 1982 he began working with his father where he learned the IPT, which was discovered by his grandfather.|Dr. Donato Pérez García has dedicated himself to introducing the treatment in Mexico, South America, Europe, Asia and North Africa, training physicians that offer IPT as an option for treating cancer and other degenerative diseases. Since then he has continued with annual seminars, attended by international doctors and presentations on IPTLD® to the United States government organization NIH\/NCI\/OCCAM.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-donato-perez-garcia\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"2013- Board Member of Hospital Angeles Medical Society|2009- IPTLD® is a Trademark|2011- Board Member of Hospital Angeles Medical Society|2007- Medical staff member at Hospital Angeles|1992 – Member of Torres de Agua Caliente Medical Society. Tijuana, B.C. Mex|1991 – Leaders in American Innovation|1988 – Who’s Who in Mexico|1988 – Men of Achievement|1988 – The New York Academy of Sciences|1985-1997 – Sociedad Mexicana de Medicina General B.C|Personalities of America, Fifth Edition|Distinguished Leadership Award, Second Edition","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/07\/Dr_Donato_.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Jorge Luna","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Luna earned his medical degree at Universidad Autonoma de Baja California, Mexicali, Mexico, specializing in Internal Medicine.|His extensive education includes Fellowships at the Instituto Nacional de Cardiologia in Mexico City in Cardiovascular Medicine with a sub-specialty in Cardiology, and in Cardiac Catheterization with a sub-specialty in Invasive Cardiology.|Post-Doctoral Fellowships in the U.S. followed at Stanford University School of Medicine (California) in Cardiovascular Medicine and Interventional Cardiology.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-jorge-luna\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/04\/Jorge-Luna-Guerra_00g.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dra. Daniela Gutiérrez Mendoza","provider":"Dental Surgeon|Plastic surgery","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dra-daniela-gutierrez-mendoza\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/04\/Dra_Daniela_Gutiérrez_Mendoza_002.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Guadalupe Carrillo Cisneros","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Carrillo got her degree as a General Physician at Universidad Autónoma de Baja California in Tijuana, Mexico. She continued her education at UNAM’s Department for Health Services for her three different specialties: General Surgery, Hand Surgery and Reconstructive and Aesthetic Plastic Surgery.|She has over 20 years of experience working with patients suffering from burns, traumatic injuries hand injuries and diabetic foot. In addition, she has been the Head of the Department of Reconstructive and Aesthetic Plastic Surgery for the Red Cross in Tijuana and Rosarito.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-carrillo-cisneros-guadalupe\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/8-Guadalupe-Carrillo-Cisneros.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr Arturo Blancas","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-arturo-blancas\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/4-Arturo-Blancas-Ruiz.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Gonzalo Jimenez","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Jimenez graduated from the Autonomous University of Guadalajara (UAG). He completed his specialty training in Surgical Otolaryngology in the National Institute of Respiratory Diseases (INER 2003) in Mexico City. He is certified by the Board of Otolaryngology Head and Neck Surgery in Mexico.|His special interest is Rhinology Surgery (Nose and Paranasal Sinus Surgery). Dr. Jimenez was lead investigator in a cancer study by the Mexican Society of Otolaryngology Head and Neck Surgery in 2003, and he frequently publishes articles in the Journal of Head and Neck Surgery in the United States.","spokenLanguages":"English, Spanish.","website":"https:\/\/www.angeleshealth.com\/dr-gonzalo-jimenez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/13-Gonzalo-Jiménez-Orci.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Mario Vergara","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Vergara graduated with Honors from Autonomous University of Baja California in Tijuana. He specialized in Ophthalmology at Hermosillo General Hospital in Sonora, Mexico, and trained in his sub-specialty of Glaucoma and Cataract Surgery in Mexico City.|Dr. Vergara has 9 years of clinical experience performing Ophthalmic Surgery. He’s performed:|He is bilingual and currently on staff at Hospital Angeles Tijuana.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-mario-vergara\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Graduate of the Autonomous University of Baja California, Tijuana.|Member of the American Academy of Ophthalmology.|Member of American Society of Cataract and Refractive Surgery.|Member of the International Society of Refractive Surgery.|Member of the Mexican Society of Ophthalmology.|Member of the Mexican Society of Glaucoma.|Medical Doctor’s License #2962591.|Ophthalmology License #4110465.|Advanced Cardiac Life Support certified.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/7-Mario-Vergara-Sinta.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"","provider":"","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"","website":"https:\/\/www.angeleshealth.com\/dr-fabian-walters-angeles-hospital\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Natalia Rebollo Dominguez","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"","website":"https:\/\/www.angeleshealth.com\/dr-natalia-rebollo-dominguez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/17-Natalia-Rebollo-Domínguez.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Esteban Ramírez Gozález","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"","website":"https:\/\/www.angeleshealth.com\/dr-esteban-ramirez-gozalez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/10-Esteban-Ramírez-Gozález.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. José Luis Aguilar Arceo","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Aguilar got his degree in Medicine from the La Salle University in Mexico City. Following his specialty in Orthopedic and Trauma Surgery at the National Institute of Rehabilitation where he also did his fellowship in Wrist, Hand and Microsurgery. He then went to Torreon, Coahuila at did a fellowship in Braquial Plexus and Peripheral Nerve Injury.|Dr. Aguilar continues to train to broaden this area of expertise attending the Annual Meeting of Mexican Federation of College of Orthopedic and Traumatology (FEMECOT), the Annual Meeting of American Association for Surgery of the Hand (ASSH) in the United States, the International Meeting of Hand Surgery of the Mexican Society of Hand and Microsurgery and the Annual Meeting of American Academy of Orthopedic Surgeons (AAOS).","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-jose-luis-aguilar-arceo\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/11\/Jose-Luis-Aguilar-Arceo-MD.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr Alejandro Lira Dale","provider":"Ophthalmologist|Oncology","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Lira got his Medical Degree at the Autonomous University of Guadalajara, following with his Urology Residency and the National and Autonomous University of Mexico. While being a resident he was in the William J. Harrington Program of the University of Miami in Jackson Memorial Hospital and in Puigvert Foundation in Barcelona Spain. In addition, he did a post graduate study in Urodinamics in the National Institute of Perinatology in Mexico City.","spokenLanguages":"","website":"https:\/\/www.angeleshealth.com\/dr-alejandro-lira-dale\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/12\/Dr_Alejandro_Lira_01.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Cesar Amescua","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Cesar Amescua – Pain Management Specialist|\nDr. Amescua earned his medical degree in Mexico City at the Universidad Nacional Autonoma de Mexico. Following graduation, he completed a two-year internship, then specialized in Anesthesia at the Hospital General de Mexico.|Ongoing education includes two years of study on Pain Management at the Pain Clinic of the Instituto Nacional de Cancerologia in Mexico City, where he later spent three additional years as Coordinator of the Pain Clinic.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-cesar-amescua\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2019\/05\/Dr.-Cesar-Amescua-600x577.png","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Mauricio Marcos Fahme","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Marcos obtained his Medical Degree with honors from UANL and his General Surgery residency at HSJ-TEC in Monterrey, Mexico. He completed his Plastic Surgery residency program as chief of residents at ICRJ in Guadalajara, Mexico, along with Dr. Jose Guerrero Santos, who chose him as his fellow for another year. Due to his excellent performance, he was granted a two-year fellowship in Body Contouring Surgery in Rio de Janeiro, Brazil, under the supervision of the world’s most famous plastic surgeon, Dr. Ivo Pitanguy. During his postgraduate training, he also completed other fellowships with other renowned plastic surgeons in Brazil like Dr. Ronaldo Pontes and Dr Liacyr Ribeiro giving him the chance to learn and master Facial and Breast Plastic Surgery techniques.|At his return, Dr. Marcos was appointed as Chief of Plastic Surgery at his home hospital. He has worked in private practice for more than 25 years and has performed thousands of aesthetic procedures. He performs cosmetic and aesthetic plastic surgery in Monterrey, Mexico and Curitiba, Brazil.","spokenLanguages":"English, Spanish, Portuguese","website":"https:\/\/www.angeleshealth.com\/dr-mauricio-marcos-fahme\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Member of the International Society of Aesthetic Plastic Surgery.|Member of the International Association of Ex- Alumni of Professor Ivo Pitanguy.|Member of the Brazilian Society of Plastic Surgery.|Member of the Mexican Association of Aesthetic and Reconstructive Plastic Surgery.|Member of the Northeastern Regional Mexican Association of Aesthetic and Reconstructive Surgery.|Board Certified and Re-Certified Plastic Surgeon by the Mexican Board of Aesthetic and Reconstructive Plastic Surgery.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2019\/03\/DR.-MAURICIO-MARCOS-FAHME-1-600x939.jpg","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Ricardo A. Martinez Moreno","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Martinez is a Plastic Surgeon with more than 20 years of experience in the field. He has performed thousands of aesthetic surgeries in countries such as Mexico, Brazil, Spain and Scotland to name a few. He has launched projects to open Clinic for Cosmetic Surgery, Anti-aging and Transformation Programs in Spain, Mexico and Brazil.|In addition, Dr. Martinez has collaborated in projects for the development of new Aesthetic Surgery Techniques such as: Megalipoesculture, Stem Cell Face Lift, Facial Rejuvenation Programs Obagi and Anti-aging with advanced Cell Therapy. He has worked as a consultant in Hospitals and Clinics in Mexico and Spain and led teams of medical professionals and nurses in updating courses of Quality Control and Services in Cosmetic Surgery and Rejuvenation Programs.|Currently he works as our Regenerative Plastic Surgeon in Hospital Angeles – Valle Oriente in Monterrey, Mexico.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-ricardo-a-martinez-moreno\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"American Academy of Cosmetic Surgery.|American Society of Liposuction Surgery.|Interamerican Society of Cosmetic, Plastic and Reconstructive Surgery.|American Academy of Anti-aging Medicine.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2019\/03\/DR.-RICARDO-MARTINEZ-1-600x900.jpg","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Sergio Javier López Martínez","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. López studied Medicine in a private University in Monterrey and interned in a private hospital in Monterrey called “Christus Muguerza Hospital”. He specialized as a General Surgeon in the Metropolitan Hospital “Dr. Bernardo Sepulveda” in Monterrey, Nuevo Leon in Mexico, where he was named Chief of Residents. After his years in Monterrey, he continued his education and studied |Endoscopic Surgery, Gastrointestinal Diagnostic and Therapeutic Endoscopy, Gastrointestinal Motility and Physiology, all in the General Hospital of Mexico City “Dr. Manuel Gea González”.|He has worked as Laparoscopic and Endoscopic Surgeon in the General Hospital “Dr. Manuel Gea González” of Mexico City, as well as a Gastrointestinal Endoscopist in the Endoscopy Unit and the Surgeon of the Bariatric and Metabolic Surgery Clinic in the same hospital. In addition, he has the credentials to practice Diagnostic and Therapeutic Endoscopy, Bariatric, Metabolic, Laparoscopic and Endoscopic Surgery in all of Monterrey’s certified and private hospitals.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-sergio-javier-lopez-martinez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Mexican Association of Endoscopic Surgery (AMCE).|Mexican College of Surgery for Obesity and Metabolic Diseases (CMOCOEM).|Mexican Association of Gastrointestinal Endoscopy (AMEG).|Latin American Association of Endoscopic Surgery (ALACE).|American Society for Gastrointestinal Endoscopy (ASGE).|Society of American Gastrointestinal and Endoscopic Surgeons (SAGES).|Association of Bariatric Endoscopy (ABE).","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2019\/03\/DR.-SERGIO-LOPEZ-1-600x900.jpg","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Ana Carolina Ramírez Cázares","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Ramírez received her Surgical and Obstetrician Degree in the School of Medicine of the Autonomous University of Nuevo Leon. After which, she did a specialty in Pediatrics and then a sub specialty in Hematology and Transplants of Hematopoietic Cells in the Hospital University “Dr. José Eleuterio González”.|She then went to study the “Transplantation of Hematopoietic Cells and Stem Cell Therapy” in the Klinikum Univeristy in Tubingen Germany. In addition, Dr. Ramírez has attended different workshops in Hematology, Biomedical Research and Pediatrics.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-ana-carolina-ramirez-cazares\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"https:\/\/www.angeleshealth.com\/wp-content\/uploads\/2018\/09\/medical-check-up-400x300.jpg","otherActivities":" |. 2013; 14 (1): 50-53.| | 2013; 14 (3); 154-157.| | 2016; 00: 1-5.","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Laura Villarreal Martínez","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Villarreal received her Surgeon Medical Degree at the Medicine Faculty of the Autonomous University of Nuevo Leon. She has a specialty in Pediatrics and a sub-specialty in Pediatric Hematology in University Hospital “Dr. José Eleuterio González”. She has a post-specialty in Hematopoietic stem cell transplantation and cell therapy in the same hospital university. In addition, she has a specialized training in hemorrhagic diseases in “Gulf States Hemophilia and Thrombophilia Center” in Texas.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-laura-villarreal-martinez\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Member of National Research System.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Daniel Morales","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Morales is a graduate of the Faculty of Medicine at Autonomous University of Baja California, Mexico. His internship was performed at the General Hospital of Mexicali, Mexico.|Dr. Morales continued his education, specializing in Neurosurgery at the Autonomous University of Nuevo Leon, with a sub-specialty in Neurological Endovascular Therapy.|Currently on staff at Hospital Angeles Tijuana, Dr. Morales is also on staff at the Institute of Social Security in Tijuana.|Teaching activity includes work as a visiting Professor for Neurological Endovascular Therapy at the Autonomous University of Nuevo Leon, and as a Professor of Neurophysiology at the Autonomous University of Baja California.|Dr. Morales’ is a frequent contributor to medical publications, and a regular attendee and participant in medical conferences throughout Mexico.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-daniel-morales\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Graduate, Faculty of Medicine at Autonomous University of Baja California, Mexico.|Member, Mexican Society of Neurological Surgery.|License # 3358003.","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. David Nava","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Nava is a graduate of National Autonomous University of Mexico in Mexico City. He completed his residency training at 20 de Noviembre Medical Center. He completed his advanced training in endocrinology and infertility as a clinical fellow at Century XXI Medical Center in Mexico City.|Dr. Nava is the founder and director of FERTILITE, Hospital Angeles Tijuana’s Fertility Center. He specializes in Reproductive Endocrinology and infertility and is certified by the Mexican Board of Obstetrics and Gynecology.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-david-nava\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Cleysa Hemosillo","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"Dr. Hermosillo is a graduate of the Autonomous University of Baja California in Tijuana. Post-graduate education includes training in Clinical Nutriology at CETYS University in Tijuana, and a medical internship at the Mexican Institute of Social Security.|Dr. Hermosillo is an Attending Physician and Nutrition Specialist for Hospital Angeles Bariatric Program. She participates in the preparation of the patient for Bariatric Surgery and in the educational process before and after surgery. She also participates in the follow up care, providing advice to patients after surgery and performing band fills.|Dr. Hermosillo is an active participant in medical conferences throughout Mexico.","spokenLanguages":"English, Spanish","website":"https:\/\/www.angeleshealth.com\/dr-cleysa-hemosillo\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"Graduate of the Autonomous University of Baja California, Tijuana.|Member of the Mexican College for Obesity and Metabolic Surgery","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"","otherActivities":"","alternativeMedicine":null},{"doctorId":null,"name":"Dr. Arturo Valenzuela","provider":"Dental Surgeon|-","phoneNumber":null,"location":"Angeles Health International","description":"","spokenLanguages":"","website":"https:\/\/www.angeleshealth.com\/dr-arturo-valenzuela\/","email":null,"hoursOperation":null,"hoursOperationObj":null,"confirmedHours":false,"ratings":null,"rating":null,"education":"","additionalInformation":"","teleHealth":null,"city":"Tijuana","country":"mx","photoUrl":"","otherActivities":"","alternativeMedicine":null}]